<!-- dflook/terraform-github-actions {"workspace":"fix-summary-outputs-2","backend_type":"remote","backend":"125b3868b1925274b297b87f06602b2fd9ae15e0e6eaae7a4e7ae74879b590d9","plan_job_ref":"Job Test Terraform cloud #222 at https://github.com/dflook/terraform-github-actions/actions/runs/7462030959","plan_hash":"bfe8b014f0bdba6c86c571cf93f941f5423589bd85e12eb0558b92f9c7b8ae16","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __fix-summary-outputs-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #222](https://github.com/dflook/terraform-github-actions/actions/runs/7462030959)